results/raw/java17/quarkus/aggregate-platform-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/patriciarego/Desktop/dev/java-lts-performance-lab/infra/k6/aggregate.js
        output: json (/Users/patriciarego/Desktop/dev/java-lts-performance-lab/results/raw/java17/quarkus/aggregate-platform-k6.json)

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 50 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  0m01.0s/1m0s

running (0m02.0s), 50/50 VUs, 1000 complete and 0 interrupted iterations
default   [   3% ] 50 VUs  0m02.0s/1m0s

running (0m03.0s), 50/50 VUs, 1550 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  0m03.0s/1m0s

running (0m04.0s), 50/50 VUs, 2070 complete and 0 interrupted iterations
default   [   7% ] 50 VUs  0m04.0s/1m0s

running (0m05.0s), 50/50 VUs, 2600 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  0m05.0s/1m0s

running (0m06.0s), 50/50 VUs, 3147 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  0m06.0s/1m0s

running (0m07.0s), 50/50 VUs, 3651 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  0m07.0s/1m0s

running (0m08.0s), 50/50 VUs, 4197 complete and 0 interrupted iterations
default   [  13% ] 50 VUs  0m08.0s/1m0s

running (0m09.0s), 50/50 VUs, 4707 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  0m09.0s/1m0s

running (0m10.0s), 50/50 VUs, 5250 complete and 0 interrupted iterations
default   [  17% ] 50 VUs  0m10.0s/1m0s

running (0m11.0s), 50/50 VUs, 5782 complete and 0 interrupted iterations
default   [  18% ] 50 VUs  0m11.0s/1m0s

running (0m12.0s), 50/50 VUs, 6272 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  0m12.0s/1m0s

running (0m13.0s), 50/50 VUs, 6809 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  0m13.0s/1m0s

running (0m14.0s), 50/50 VUs, 7355 complete and 0 interrupted iterations
default   [  23% ] 50 VUs  0m14.0s/1m0s

running (0m15.0s), 50/50 VUs, 7888 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  0m15.0s/1m0s

running (0m16.0s), 50/50 VUs, 8415 complete and 0 interrupted iterations
default   [  27% ] 50 VUs  0m16.0s/1m0s

running (0m17.0s), 50/50 VUs, 8957 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  0m17.0s/1m0s

running (0m18.0s), 50/50 VUs, 9474 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  0m18.0s/1m0s

running (0m19.0s), 50/50 VUs, 10019 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  0m19.0s/1m0s

running (0m20.0s), 50/50 VUs, 10557 complete and 0 interrupted iterations
default   [  33% ] 50 VUs  0m20.0s/1m0s

running (0m21.0s), 50/50 VUs, 11074 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  0m21.0s/1m0s

running (0m22.0s), 50/50 VUs, 11609 complete and 0 interrupted iterations
default   [  37% ] 50 VUs  0m22.0s/1m0s

running (0m23.0s), 50/50 VUs, 12138 complete and 0 interrupted iterations
default   [  38% ] 50 VUs  0m23.0s/1m0s

running (0m24.0s), 50/50 VUs, 12673 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  0m24.0s/1m0s

running (0m25.0s), 50/50 VUs, 13206 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  0m25.0s/1m0s

running (0m26.0s), 50/50 VUs, 13731 complete and 0 interrupted iterations
default   [  43% ] 50 VUs  0m26.0s/1m0s

running (0m27.0s), 50/50 VUs, 14274 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  0m27.0s/1m0s

running (0m28.0s), 50/50 VUs, 14806 complete and 0 interrupted iterations
default   [  47% ] 50 VUs  0m28.0s/1m0s

running (0m29.0s), 50/50 VUs, 15325 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  0m29.0s/1m0s

running (0m30.0s), 50/50 VUs, 15874 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  0m30.0s/1m0s

running (0m31.0s), 50/50 VUs, 16388 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  0m31.0s/1m0s

running (0m32.0s), 50/50 VUs, 16924 complete and 0 interrupted iterations
default   [  53% ] 50 VUs  0m32.0s/1m0s

running (0m33.0s), 50/50 VUs, 17456 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  0m33.0s/1m0s

running (0m34.0s), 50/50 VUs, 17976 complete and 0 interrupted iterations
default   [  57% ] 50 VUs  0m34.0s/1m0s

running (0m35.0s), 50/50 VUs, 18518 complete and 0 interrupted iterations
default   [  58% ] 50 VUs  0m35.0s/1m0s

running (0m36.0s), 50/50 VUs, 19055 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  0m36.0s/1m0s

running (0m37.0s), 50/50 VUs, 19573 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  0m37.0s/1m0s

running (0m38.0s), 50/50 VUs, 20117 complete and 0 interrupted iterations
default   [  63% ] 50 VUs  0m38.0s/1m0s

running (0m39.0s), 50/50 VUs, 20642 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  0m39.0s/1m0s

running (0m40.0s), 50/50 VUs, 21186 complete and 0 interrupted iterations
default   [  67% ] 50 VUs  0m40.0s/1m0s

running (0m41.0s), 50/50 VUs, 21718 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  0m41.0s/1m0s

running (0m42.0s), 50/50 VUs, 22268 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  0m42.0s/1m0s

running (0m43.0s), 50/50 VUs, 22788 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  0m43.0s/1m0s

running (0m44.0s), 50/50 VUs, 23318 complete and 0 interrupted iterations
default   [  73% ] 50 VUs  0m44.0s/1m0s

running (0m45.0s), 50/50 VUs, 23841 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  0m45.0s/1m0s

running (0m46.0s), 50/50 VUs, 24369 complete and 0 interrupted iterations
default   [  77% ] 50 VUs  0m46.0s/1m0s

running (0m47.0s), 50/50 VUs, 24915 complete and 0 interrupted iterations
default   [  78% ] 50 VUs  0m47.0s/1m0s

running (0m48.0s), 50/50 VUs, 25438 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  0m48.0s/1m0s

running (0m49.0s), 50/50 VUs, 25968 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  0m49.0s/1m0s

running (0m50.0s), 50/50 VUs, 26518 complete and 0 interrupted iterations
default   [  83% ] 50 VUs  0m50.0s/1m0s

running (0m51.0s), 50/50 VUs, 27038 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  0m51.0s/1m0s

running (0m52.0s), 50/50 VUs, 27568 complete and 0 interrupted iterations
default   [  87% ] 50 VUs  0m52.0s/1m0s

running (0m53.0s), 50/50 VUs, 28088 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  0m53.0s/1m0s

running (0m54.0s), 50/50 VUs, 28620 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  0m54.0s/1m0s

running (0m55.0s), 50/50 VUs, 29138 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  0m55.0s/1m0s

running (0m56.0s), 50/50 VUs, 29668 complete and 0 interrupted iterations
default   [  93% ] 50 VUs  0m56.0s/1m0s

running (0m57.0s), 50/50 VUs, 30196 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  0m57.0s/1m0s

running (0m58.0s), 50/50 VUs, 30724 complete and 0 interrupted iterations
default   [  97% ] 50 VUs  0m58.0s/1m0s

running (0m59.0s), 50/50 VUs, 31247 complete and 0 interrupted iterations
default   [  98% ] 50 VUs  0m59.0s/1m0s

running (1m00.0s), 50/50 VUs, 31773 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  1m00.0s/1m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=47.73ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 31832   529.691345/s
    checks_succeeded...: 100.00% 31832 out of 31832
    checks_failed......: 0.00%   0 out of 31832

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=43.99ms min=40.19ms med=43.69ms max=115.29ms p(90)=46.66ms p(95)=47.73ms
      { expected_response:true }...: avg=43.99ms min=40.19ms med=43.69ms max=115.29ms p(90)=46.66ms p(95)=47.73ms
    http_req_failed................: 0.00%  0 out of 31832
    http_reqs......................: 31832  529.691345/s

    EXECUTION
    iteration_duration.............: avg=94.3ms  min=90.28ms med=94ms    max=165.96ms p(90)=96.99ms p(95)=98.11ms
    iterations.....................: 31832  529.691345/s
    vus............................: 50     min=50         max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 9.4 MB 156 kB/s
    data_sent......................: 3.0 MB 49 kB/s



running (1m00.1s), 00/50 VUs, 31832 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  1m0s